#+TITLE: About functional-json

This is a fork of [[https://marijnhaverbeke.nl/st-json/][ST-JSON]] with extra utilities to streamline
JSON processing and work with JSON from the REPL.

This fork aims to be backwards compatible with ST-JSON.  Using src_lisp[:exports code]{(use-package :functional-json)}
will work as a drop in replacement for src_lisp[:exports code]{(use-package :st-json)}.

** Use `fj:jsoλ` to create access functions.

#+BEGIN_SRC lisp :results output
  (let* ((url "https://api.github.com/repos/jl2/functional-json/contents/")
         (json-list (fj:read-json (dex:get url)))

         ;; fj:jsoλ creates a function that, when called on a JSON object returns the value stored there.
         ;; In this case, html-link is a function that, when called on a JSON object, fetchs the "_links" entry, and then fetchs the "html" entry from it.
         (html-link (fj:jsoλ :_links :html)))

    ;; Print the html-link of every object in json-list
    (mapc (compose #'print html-link) json-list))
#+END_SRC

#+RESULTS:
#+begin_example

"https://github.com/jl2/functional-json/blob/master/.gitignore"
"https://github.com/jl2/functional-json/blob/master/LICENSE"
"https://github.com/jl2/functional-json/blob/master/Makefile"
"https://github.com/jl2/functional-json/blob/master/README.org"
"https://github.com/jl2/functional-json/blob/master/functional-json.asd"
"https://github.com/jl2/functional-json/blob/master/functional-json.lisp"
"https://github.com/jl2/functional-json/blob/master/functional-json.test.asd"
"https://github.com/jl2/functional-json/blob/master/package.lisp"
"https://github.com/jl2/functional-json/blob/master/readers.lisp"
"https://github.com/jl2/functional-json/tree/master/t"
"https://github.com/jl2/functional-json/blob/master/utils.lisp"
"https://github.com/jl2/functional-json/blob/master/writers.lisp"
#+end_example


** Use `fj:at` to access fields.

#+BEGIN_SRC lisp :results output
  (let* ((url "https://api.github.com/repos/jl2/functional-json/contents/")
         (json-list (fj:read-json (dex:get url :want-stream t)))
         (json (fj:at json-list 1)))


    ;; Index into arrays and lists using integers, into
    ;; objects using strings, symbols, or keywords
    ;; Print the _links sub-component from the first entry.
    (format t "First: ~a~%" (fj:at json-list 1 :_links))

    ;; Swap fields and make modifications
    ;; Object references are places and can be modified using setf and
    ;; related functions like rotatef
    (rotatef (fj:at json :_links 'git)
             (fj:at json :_links "self") )
    (format t "Swapped: ~a~%" (fj:at json :_links))

    ;; (setf at) doesn't support array/list indexing
    ;; so the following commented lines would *fail* with an error condition
    ;;(rotatef (fj:at json-list 0 :_links 'git)
    ;;         (fj:at json-list 0 :_links "self") )
    ;;(format t "Swapped: ~a~%" (fj:at json-list 0 :_links))

    (rotatef (fj:at json :_links :git) (fj:at json :_links :self) )
    (format t "Swapped back: ~a~%" (fj:at json-list 1 :_links)))
#+END_SRC

#+RESULTS:
#+begin_example
First: {
    "self": "https://api.github.com/repos/jl2/functional-json/contents/LICENSE?ref=master",
    "git": "https://api.github.com/repos/jl2/functional-json/git/blobs/c38463ccce58b4a1b971dec1b900e00187f791ec",
    "html": "https://github.com/jl2/functional-json/blob/master/LICENSE"
}
Swapped: {
    "self": "https://api.github.com/repos/jl2/functional-json/git/blobs/c38463ccce58b4a1b971dec1b900e00187f791ec",
    "git": "https://api.github.com/repos/jl2/functional-json/contents/LICENSE?ref=master",
    "html": "https://github.com/jl2/functional-json/blob/master/LICENSE"
}
Swapped back: {
    "self": "https://api.github.com/repos/jl2/functional-json/contents/LICENSE?ref=master",
    "git": "https://api.github.com/repos/jl2/functional-json/git/blobs/c38463ccce58b4a1b971dec1b900e00187f791ec",
    "html": "https://github.com/jl2/functional-json/blob/master/LICENSE"
}
#+end_example



